<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of Crypt2 client from Github.</string>
    <key>Identifier</key>
    <string>com.github.grahamgilbert.Crypt2.download</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Crypt2</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <<key>warning_message</key>
                <string>This recipe is now non-functional and has been replaced by https://github.com/autopkg/grahamgilbert-recipes/tree/master/Crypt. Please remove it from your list of recipes.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
