<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages the current release of Buildkite Agent.</string>
    <key>Identifier</key>
    <string>com.github.grahamgilbert.BuildkiteAgent.pkg</string>
    <key>ParentRecipe</key>
    <string>com.github.grahamgilbert.BuildkiteAgent.download</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BuildkiteAgent</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>BuildkiteVersioner</string>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Create a pkg root - /usr/local/bin/</string>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/BuildkiteAgent_pkg</string>
                <key>pkgdirs</key>
                <dict>
                    <key>usr</key>
                    <string>01775</string>
                    <key>usr/local/</key>
                    <string>0775</string>
                    <key>usr/local/bin/</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/BuildkiteAgent/buildkite-agent</string>
                <key>target</key>
                <string>%pkgroot%/usr/local/bin/buildkite-agent</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%/</string>
                    <key>id</key>
                    <string>com.github.grahamgilbert.pkg.buildkiteagent</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>usr/local/bin/buildkite-agent</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                            <key>mode</key>
                            <string>0755</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
