<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent recipe to download latest iStat Menus and installs it.</string>
        <key>Identifier</key>
        <string>com.github.grahamgilbert.install.iStatMenus</string>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.keeleysam.recipes.Bjango.iStatMenus.download</string>
        <key>Input</key>
        <dict>
        </dict>
        <key>Process</key>
        <array>
            dict>
    			<key>Arguments</key>
    			<dict>
    				<key>archive_path</key>
    				<string>%pathname%</string>
    				<key>destination_path</key>
    				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
    				<key>purge_destination</key>
    				<true/>
    			</dict>
    			<key>Processor</key>
    			<string>Unarchiver</string>
    		</dict>
    		<dict>
    			<key>Arguments</key>
    			<dict>
    				<key>dmg_path</key>
    				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
    				<key>dmg_root</key>
    				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
    			</dict>
    			<key>Processor</key>
    			<string>DmgCreator</string>
    		</dict>
          <dict>
      			<key>Arguments</key>
      			<dict>
      				<key>dmg_path</key>
      				<string>%dmg_path%</string>
      				<key>items_to_copy</key>
      				<array>
      					<dict>
      						<key>destination_path</key>
      						<string>/Applications</string>
      						<key>source_item</key>
      						<string>%NAME%.app</string>
      					</dict>
      				</array>
      			</dict>
      			<key>Processor</key>
      			<string>InstallFromDMG</string>
      		</dict>
        </array>
    </dict>
</plist>
