<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Uses parent pkg recipe to download latest Puppet-Agent and installs it.</string>
		<key>Identifier</key>
		<string>com.github.grahamgilbert.install.puppet-agent</string>
		<key>MinimumVersion</key>
		<string>0.4.0</string>
		<key>ParentRecipe</key>
		<string>com.github.autopkg.download.puppet-agent</string>
		<key>Input</key>
		<dict>
			<key>OS_VERSION</key>
			<string>10.12</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>Installer</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%/*.pkg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
