<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of the Google Chrome Enterprise Package and imports it into Munki.</string>
		<key>Identifier</key>
		<string>com.github.grahamgilbert.munki.GoogleChromeEnterprise</string>
		<key>Input</key>
		<dict>
			<key>APP_FILENAME</key>
			<string>Google Chrome</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/%NAME%</string>
			<key>NAME</key>
			<string>GoogleChrome</string>
			<key>pkginfo</key>
			<dict>
				<key>blocking_applications</key>
				<array>
					<string>Google Chrome</string>
				</array>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>Chrome is a fast, simple, and secure web browser, built for the modern web.</string>
				<key>developer</key>
				<string>Google</string>
				<key>display_name</key>
				<string>Google Chrome</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.autopkg.munki.googlechromepkg</string>
		<key>Process</key>
		<array/>
	</dict>
</plist>
