<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of Crypt client from Github.</string>
    <key>Identifier</key>
    <string>com.github.grahamgilbert.Crypt.download</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Crypt</string>
        <key>PRERELEASE</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>grahamgilbert/crypt</string>
                <key>include_prereleases</key>
                <string>%PRERELEASE%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Graham Gilbert (9D8XP85393)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
