<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Takes a downloaded "Blackboard Collaborate Launcher.app" from the Caches folder and turns it into a package.</string>
    <key>Identifier</key>
    <string>com.github.grahamgilbert.BlackboardCollaborateLauncher.pkg</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BlackboardCollaborateLauncher</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.blackboardcollaboratelauncher</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Create a pkg root - /Lib/Management/BlackboardCollaborate/, and /usr/local/outset/login-every</string>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/Blackboard_pkg</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>01775</string>
                    <key>Library/Management/</key>
                    <string>0775</string>
                    <key>Library/Management/BlackboardCollaborate</key>
                    <string>0775</string>
                    <key>usr</key>
                    <string>01775</string>
                    <key>usr/local/</key>
                    <string>0775</string>
                    <key>usr/local/outset/</key>
                    <string>0775</string>
                    <key>usr/local/outset/login-every</key>
                    <string>01775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Unpacks the Blackboard Collaborate Launcher.zip file</string>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.zip</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/Management/BlackboardCollaborate/</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy the outset script into the pkgroot</string>
            <key>Processor</key>
            <string>ParentCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>copy-blackboard.sh</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/outset/login-every/</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%/</string>
                    <key>id</key>
                    <string>com.grahamgilbert.pkg.blackboardcollaboratelauncher</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>usr/local/outset/login-every/copy-blackboard.sh</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                            <key>mode</key>
                            <string>0755</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Clean up after ourselves</string>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%pkgroot%</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>